harviswang/linux-3.10.99/arch/mips/m200/driverlib/msc.c
//*****************************************************************************
//
// msc.c - Driver for the MSC(MMC/SD Controller).
//
// Copyright (c) 2017 Harvis Wang.  All rights reserved.
// Software License Agreement
//
//   Redistribution and use in source and binary forms, with or without
//   modification, are permitted provided that the following conditions
//   are met:
//
//   Redistributions of source code must retain the above copyright
//   notice, this list of conditions and the following disclaimer.
//
//   Redistributions in binary form must reproduce the above copyright
//   notice, this list of conditions and the following disclaimer in the
//   documentation and/or other materials provided with the
//   distribution.
//
// THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
// "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
// LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
// A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT
// OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
// SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
// LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
// DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
// THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
// (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
// OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
//
//*****************************************************************************

#include "../inc/hw_msc.h"
#include "../inc/hw_memmap.h"
#include "../inc/hw_types.h"
#include "debug.h"
#include "msc.h"
#include "intc.h"

//*****************************************************************************
//
// A mapping of MSC base address to interupt number.
//
//*****************************************************************************
static const unsigned long g_ppulMSCIntMap[][2] =
{
    { MSC0_BASE, IRQ_NO_MSC0 },
    { MSC1_BASE, IRQ_NO_MSC1 },
    { MSC2_BASE, IRQ_NO_MSC2 },
};

//*****************************************************************************
//
//! \internal
//! Checks a MSC base address.
//!
//! \param ulBase is the base address of the MSC.
//!
//! This function determines if a MSC port base address is valid.
//!
//! \return Returns \b true if the base address is valid and \b false
//! otherwise.
//*****************************************************************************
#ifdef DEBUG
static tBoolean
MSCBaseValid(unsigned long ulBase)
{
    return((ulBase == MSC0_BASE) || (ulBase == MSC1_BASE) ||
           (ulBase == MSC2_BASE));
}
#endif

//*****************************************************************************
//
//! Print all register value.
//!
//! \param ulBase is the base address of the MSC.
//! \param print is a function pointer like printf.
//!
//! This function print value of all register in a MSC.
//!
//! \return none
//
//*****************************************************************************
void
MSCRegisterDump(unsigned long ulBase, int (*print)(const char *format, ...))
{
    //
    // Check the arguments.
    //
    ASSERT(MSCBaseValid(ulBase));

    REGH_PRINT(MSC_O_CTRL,  ulBase, print);
    REG_PRINT(MSC_O_STAT,   ulBase, print);
    REGH_PRINT(MSC_O_CLKRT, ulBase, print);
    REG_PRINT(MSC_O_CMDAT,  ulBase, print);
    REGH_PRINT(MSC_O_RESTO, ulBase, print);
    REG_PRINT(MSC_O_RDTO,   ulBase, print);
    REGH_PRINT(MSC_O_BLKEN, ulBase, print);
    REGH_PRINT(MSC_O_NOB,   ulBase, print);
    REG_PRINT(MSC_O_SNOB,   ulBase, print);
    REG_PRINT(MSC_O_IMASK,  ulBase, print);
    REG_PRINT(MSC_O_IFLG,   ulBase, print);
    REGB_PRINT(MSC_O_CMD,   ulBase, print);
    REG_PRINT(MSC_O_ARG,    ulBase, print);
    REGH_PRINT(MSC_O_RES,   ulBase, print);
    REG_PRINT(MSC_O_RXFIFO, ulBase, print);
    REG_PRINT(MSC_O_TXFIFO, ulBase, print);
    REG_PRINT(MSC_O_LPM,    ulBase, print);
    REG_PRINT(MSC_O_DMAC,   ulBase, print);
    REG_PRINT(MSC_O_DMANDA, ulBase, print);
    REG_PRINT(MSC_O_DMADA,  ulBase, print);
    REG_PRINT(MSC_O_DMALEN, ulBase, print);
    REG_PRINT(MSC_O_DMACMD, ulBase, print);
    REG_PRINT(MSC_O_CTRL2, ulBase, print);
    REG_PRINT(MSC_O_RTCNT, ulBase, print);
}

//*****************************************************************************
//
//! Set bus width.
//!
//! \param ulBase is the base address of the MSC.
//! \param ulBusWidth is the bus width.
//!
//! This function set the bus width of a MSC.
//!
//! \return true if set operation successed, false others.
//
//*****************************************************************************
tBoolean
MSCBusWidthSet(unsigned long ulBase, unsigned long ulBusWidth)
{
    unsigned long ulReg;

    //
    // Check the arguments.
    //
    ASSERT(MSCBaseValid(ulBase));
    ASSERT((ulBusWidth == MSC_BUSWIDTH_1BIT) ||
           (ulBusWidth == MSC_BUSWIDTH_4BIT) ||
           (ulBusWidth == MSC_BUSWIDTH_8BIT));

    switch (ulBusWidth) {
        case MSC_BUSWIDTH_1BIT:
            ulReg = HWREG(ulBase + MSC_O_CMDAT);
            HWREG(ulBase + MSC_O_CMDAT) = (ulReg & (~MSC_CMDAT_BUSWIDTH)) | MSC_CMDAT_BUSWIDTH_1;
            return((HWREG(ulBase + MSC_O_CMDAT) & MSC_CMDAT_BUSWIDTH) == MSC_CMDAT_BUSWIDTH_1);
        case MSC_BUSWIDTH_4BIT:
            ulReg = HWREG(ulBase + MSC_O_CMDAT);
            HWREG(ulBase + MSC_O_CMDAT) = (ulReg & (~MSC_CMDAT_BUSWIDTH)) | MSC_CMDAT_BUSWIDTH_4;
            return((HWREG(ulBase + MSC_O_CMDAT) & MSC_CMDAT_BUSWIDTH) == MSC_CMDAT_BUSWIDTH_4);
        case MSC_BUSWIDTH_8BIT:
            ulReg = HWREG(ulBase + MSC_O_CMDAT);
            HWREG(ulBase + MSC_O_CMDAT) = (ulReg & (~MSC_CMDAT_BUSWIDTH)) | MSC_CMDAT_BUSWIDTH_8;
            return((HWREG(ulBase + MSC_O_CMDAT) & MSC_CMDAT_BUSWIDTH) == MSC_CMDAT_BUSWIDTH_8);
        default:
            return false;
    }
}

//*****************************************************************************
//
//! Enable SDIO interrupt.
//!
//! \param ulBase is the base address of the MSC.
//!
//! This function enable the interrupt of a MSC SDIO.
//!
//! \return true if the enable operation successed, false others.
//
//*****************************************************************************
tBoolean
MSCSDIOInterruptEnable(unsigned long ulBase)
{
    //
    // Check the arguments.
    //
    ASSERT(MSCBaseValid(ulBase));

