harviswang/linux-3.10.99/arch/mips/m200/driverlib/msc.c
    HWREG(ulBase + MSC_O_IMASK) &= ~MSC_IMASK_SDIO;
    return((HWREG(ulBase + MSC_O_IMASK) & MSC_IMASK_SDIO) != MSC_IMASK_SDIO);
}

//*****************************************************************************
//
//! Disable SDIO interrupt.
//!
//! \param ulBase is the base address of the MSC.
//!
//! This function disable the interrupt of a MSC SDIO.
//!
//! \return true if the disable operation successed, false others.
//
//*****************************************************************************
tBoolean
MSCSDIOInterruptDisable(unsigned long ulBase)
{
    //
    // Check the arguments.
    //
    ASSERT(MSCBaseValid(ulBase));

    HWREG(ulBase + MSC_O_IMASK) |= MSC_IMASK_SDIO;
    return((HWREG(ulBase + MSC_O_IMASK) & MSC_IMASK_SDIO) == MSC_IMASK_SDIO);
}

//*****************************************************************************
//
//! MSC read time out limit set.
//!
//! \param ulBase is the base address of the MSC.
//! \param ulTimeOutClks is the unmber of MSC clock units.
//!
//! This function set the read time out of a MSC.
//!
//! \return true if the read time out set operation successed, false others.
//
//*****************************************************************************
tBoolean
MSCReadTimeOutSet(unsigned long ulBase, unsigned long ulTimeOutClks)
{
    //
    // Check the arguments.
    //
    ASSERT(MSCBaseValid(ulBase));

    HWREG(ulBase + MSC_O_RDTO) = ulTimeOutClks & MSC_RDTO_READTO;
    return((HWREG(ulBase + MSC_O_RDTO) & MSC_RDTO_READTO) == (ulTimeOutClks & MSC_RDTO_READTO));
}

//*****************************************************************************
//
//! MSC read time out limit get.
//!
//! \param ulBase is the base address of the MSC.
//!
//! This function get the read time out of a MSC.
//!
//! \return the unmber of MSC clock units.
//
//*****************************************************************************
unsigned long
MSCReadTimeOutGet(unsigned long ulBase)
{
    //
    // Check the arguments.
    //
    ASSERT(MSCBaseValid(ulBase));

    return(HWREG(ulBase + MSC_O_RDTO) & MSC_RDTO_READTO);
}

//*****************************************************************************
//
//! MSC block count set.
//!
//! \param ulBase is the base address of the MSC.
//! \param ulBlockCount is the number of requested blocks.
//!
//! This function set the number of blocks in a MSC request.
//!
//! \return true if the unmber of block is set ok, false others.
//
//*****************************************************************************
tBoolean
MSCBlockCountSet(unsigned long ulBase, unsigned long ulBlockCount)
{
    //
    // Check the arguments.
    //
    ASSERT(MSCBaseValid(ulBase));

    HWREG(ulBase + MSC_O_NOB) = ulBlockCount & MSC_NOB_NOB;
    return((HWREG(ulBase + MSC_O_NOB) & MSC_NOB_NOB) == (ulBlockCount & MSC_NOB_NOB));
}

//*****************************************************************************
//
//! MSC block count get.
//!
//! \param ulBase is the base address of the MSC.
//!
//! This function get the block number of a MSC request.
//!
//! \return the number of requested blocks.
//
//*****************************************************************************
unsigned long
MSCBlockCountGet(unsigned long ulBase)
{
    //
    // Check the arguments.
    //
    ASSERT(MSCBaseValid(ulBase));

    return(HWREG(ulBase + MSC_O_NOB) & MSC_NOB_NOB);
}

//*****************************************************************************
//
//! MSC block size set.
//!
//! \param ulBase is the base address of the MSC.
//! \param ulBlockSize is the size of one block.
//!
//! This function set the the size of one block.
//!
//! \return true if the block size is set ok, false others.
//
//*****************************************************************************
tBoolean
MSCBlockSizeSet(unsigned long ulBase, unsigned long ulBlockSize)
{
    //
    // Check the arguments.
    //
    ASSERT(MSCBaseValid(ulBase));

    HWREGH(ulBase + MSC_O_BLKEN) = (ulBlockSize & MSC_BLKEN_BLKEN);
    return((HWREGH(ulBase + MSC_O_BLKEN) & MSC_BLKEN_BLKEN) == (ulBlockSize & MSC_BLKEN_BLKEN));
}

//*****************************************************************************
//
//! MSC block size get.
//!
//! \param ulBase is the base address of the MSC.
//!
//! This function get the the size of one block.
//!
//! \return true the block size.
//
//*****************************************************************************
unsigned long
MSCBlockSizeGet(unsigned long ulBase)
{
    //
    // Check the arguments.
    //
    ASSERT(MSCBaseValid(ulBase));

    return(HWREGH(ulBase + MSC_O_BLKEN) & MSC_BLKEN_BLKEN);
}

//*****************************************************************************
//
//! MSC read timeout set.
//!
//! \param ulBase is the base address of the MSC.
//! \param ulReadTimeout is the read timeout, in MSC_CLK units.
//!
//! This function set the the read timeout.
//!
//! \return true if the read timeout is set ok, false others.
//
//*****************************************************************************
tBoolean
MSCReadTimeoutSet(unsigned long ulBase, unsigned long ulReadTimeout)
{
    //
    // Check the arguments.
    //
    ASSERT(MSCBaseValid(ulBase));

    HWREG(ulBase + MSC_O_RDTO) = (ulReadTimeout & MSC_RDTO_READTO);
    return((HWREG(ulBase + MSC_O_RDTO) & MSC_RDTO_READTO) == (ulReadTimeout & MSC_RDTO_READTO));
}

//*****************************************************************************
//
//! MSC read timeout get.
//!
//! \param ulBase is the base address of the MSC.
//!
//! This function get the the read timeout.
//!
//! \return the read timeout(in MSC_CLK units).
//
//*****************************************************************************
unsigned long
MSCReadTimeoutGet(unsigned long ulBase)
{
    //
    // Check the arguments.
    //
    ASSERT(MSCBaseValid(ulBase));

    return(HWREG(ulBase + MSC_O_RDTO) & MSC_RDTO_READTO);
}

//*****************************************************************************
//
//! MSC stream block mode enable.
//!
//! \param ulBase is the base address of the MSC.
//!
//! This function enable stream block mode in data transfer.
//!
//! \return true if stream block mode is enabled.
//
//*****************************************************************************
tBoolean
MSCStreamModeEnable(unsigned long ulBase)
{
    //
    // Check the arguments.
    //
    ASSERT(MSCBaseValid(ulBase));

    HWREG(ulBase + MSC_O_CMDAT) |= MSC_CMDAT_STREAMBLOCK;
    return((HWREG(ulBase + MSC_O_CMDAT) & MSC_CMDAT_STREAMBLOCK) == MSC_CMDAT_STREAMBLOCK);
}

//*****************************************************************************
//
//! MSC stream block mode disable.
//!
//! \param ulBase is the base address of the MSC.
//!
//! This function disable stream block mode(normal block mode) in data transfer.
//!
//! \return true if stream block mode is disabled.
//
//*****************************************************************************
tBoolean
MSCStreamModeDisable(unsigned long ulBase)
{
    //
    // Check the arguments.
    //
    ASSERT(MSCBaseValid(ulBase));

