harviswang/linux-3.10.99/arch/mips/m200/driverlib/msc.c
    HWREG(ulBase + MSC_O_CMDAT) &= ~MSC_CMDAT_STREAMBLOCK;
    return((HWREG(ulBase + MSC_O_CMDAT) & MSC_CMDAT_STREAMBLOCK) != MSC_CMDAT_STREAMBLOCK);
}

//*****************************************************************************
//
//! MSC response format set.
//!
//! \param ulBase is the base address of the MSC.
//! \param ulResponseFormat is the response format.
//!
//! This function set response format.
//!
//! \return true if the response format set operation is successed, false others.
//
//*****************************************************************************
tBoolean
MSCResponseFormatSet(unsigned long ulBase, unsigned long ulResponseFormat)
{
    unsigned long ulReg;

    //
    // Check the arguments.
    //
    ASSERT(MSCBaseValid(ulBase));
    ASSERT((ulResponseFormat == MSC_RESPONSE_NONE)  ||
           (ulResponseFormat == MSC_RESPONSE_R1R1B) ||
           (ulResponseFormat == MSC_RESPONSE_R2)    ||
           (ulResponseFormat == MSC_RESPONSE_R3)    ||
           (ulResponseFormat == MSC_RESPONSE_R4)    ||
           (ulResponseFormat == MSC_RESPONSE_R5)    ||
           (ulResponseFormat == MSC_RESPONSE_R6)    ||
           (ulResponseFormat == MSC_RESPONSE_R7));

    switch(ulResponseFormat) {
    case MSC_RESPONSE_NONE:
        ulReg = HWREG(ulBase + MSC_O_CMDAT);
        ulReg = (ulReg & ~MSC_CMDAT_RESPONSEFORMAT) | MSC_RESPONSE_NONE;
        HWREG(ulBase + MSC_O_CMDAT) = ulReg;
        return((HWREG(ulBase + MSC_O_CMDAT) & MSC_CMDAT_RESPONSEFORMAT) == MSC_RESPONSE_NONE);
    case MSC_RESPONSE_R1R1B:
        ulReg = HWREG(ulBase + MSC_O_CMDAT);
        ulReg = (ulReg & ~MSC_CMDAT_RESPONSEFORMAT) | MSC_RESPONSE_R1R1B;
        HWREG(ulBase + MSC_O_CMDAT) = ulReg;
        return((HWREG(ulBase + MSC_O_CMDAT) & MSC_CMDAT_RESPONSEFORMAT) == MSC_RESPONSE_R1R1B);
    case MSC_RESPONSE_R2:
        ulReg = HWREG(ulBase + MSC_O_CMDAT);
        ulReg = (ulReg & ~MSC_CMDAT_RESPONSEFORMAT) | MSC_RESPONSE_R2;
        HWREG(ulBase + MSC_O_CMDAT) = ulReg;
        return((HWREG(ulBase + MSC_O_CMDAT) & MSC_CMDAT_RESPONSEFORMAT) == MSC_RESPONSE_R2);
    case MSC_RESPONSE_R3:
        ulReg = HWREG(ulBase + MSC_O_CMDAT);
        ulReg = (ulReg & ~MSC_CMDAT_RESPONSEFORMAT) | MSC_RESPONSE_R3;
        HWREG(ulBase + MSC_O_CMDAT) = ulReg;
        return((HWREG(ulBase + MSC_O_CMDAT) & MSC_CMDAT_RESPONSEFORMAT) == MSC_RESPONSE_R3);
    case MSC_RESPONSE_R4:
        ulReg = HWREG(ulBase + MSC_O_CMDAT);
        ulReg = (ulReg & ~MSC_CMDAT_RESPONSEFORMAT) | MSC_RESPONSE_R4;
        HWREG(ulBase + MSC_O_CMDAT) = ulReg;
        return((HWREG(ulBase + MSC_O_CMDAT) & MSC_CMDAT_RESPONSEFORMAT) == MSC_RESPONSE_R4);
    case MSC_RESPONSE_R5:
        ulReg = HWREG(ulBase + MSC_O_CMDAT);
        ulReg = (ulReg & ~MSC_CMDAT_RESPONSEFORMAT) | MSC_RESPONSE_R5;
        HWREG(ulBase + MSC_O_CMDAT) = ulReg;
        return((HWREG(ulBase + MSC_O_CMDAT) & MSC_CMDAT_RESPONSEFORMAT) == MSC_RESPONSE_R5);
    case MSC_RESPONSE_R6:
        ulReg = HWREG(ulBase + MSC_O_CMDAT);
        ulReg = (ulReg & ~MSC_CMDAT_RESPONSEFORMAT) | MSC_RESPONSE_R6;
        HWREG(ulBase + MSC_O_CMDAT) = ulReg;
        return((HWREG(ulBase + MSC_O_CMDAT) & MSC_CMDAT_RESPONSEFORMAT) == MSC_RESPONSE_R6);
    case MSC_RESPONSE_R7:
        ulReg = HWREG(ulBase + MSC_O_CMDAT);
        ulReg = (ulReg & ~MSC_CMDAT_RESPONSEFORMAT) | MSC_RESPONSE_R7;
        HWREG(ulBase + MSC_O_CMDAT) = ulReg;
        return((HWREG(ulBase + MSC_O_CMDAT) & MSC_CMDAT_RESPONSEFORMAT) == MSC_RESPONSE_R7);
    default:
        ASSERT(false);
        return(false);
    }
}

//*****************************************************************************
//
//! MSC command busy signal set.
//!
//! \param ulBase is the base address of the MSC.
//!
//! This function set busy.
//!
//! \return true if the busy set operation is successed, false others.
//
//*****************************************************************************
tBoolean
MSCBusySet(unsigned long ulBase)
{
    //
    // Check the arguments.
    //
    ASSERT(MSCBaseValid(ulBase));

    HWREG(ulBase + MSC_O_CMDAT) |= MSC_CMDAT_BUSY;
    return((HWREG(ulBase + MSC_O_CMDAT) & MSC_CMDAT_BUSY) == MSC_CMDAT_BUSY);
}

//*****************************************************************************
//
//! MSC command busy signal clear.
//!
//! \param ulBase is the base address of the MSC.
//!
//! This function clear busy.
//!
//! \return true if the busy clear operation is successed, false others.
//
//*****************************************************************************
tBoolean
MSCBusyClear(unsigned long ulBase)
{
    //
    // Check the arguments.
    //
    ASSERT(MSCBaseValid(ulBase));

    HWREG(ulBase + MSC_O_CMDAT) &= ~MSC_CMDAT_BUSY;
    return((HWREG(ulBase + MSC_O_CMDAT) & MSC_CMDAT_BUSY) != MSC_CMDAT_BUSY);
}

//*****************************************************************************
//
//! MSC AutoCMD12 enable.
//!
//! \param ulBase is the base address of the MSC.
//!
//! This function enable Auto CMD12.
//!
//! \return true if the Auto CMD12 enable operation is successed, false others.
//
//*****************************************************************************
tBoolean
MSCAutoCMD12Enable(unsigned long ulBase)
{
    //
    // Check the arguments.
    //
    ASSERT(MSCBaseValid(ulBase));

    HWREG(ulBase + MSC_O_CMDAT) |= MSC_CMDAT_AUTOCMD12;
    return((HWREG(ulBase + MSC_O_CMDAT) & MSC_CMDAT_AUTOCMD12) == MSC_CMDAT_AUTOCMD12);
}

//*****************************************************************************
//
//! MSC AutoCMD12 disable.
//!
//! \param ulBase is the base address of the MSC.
//!
//! This function disable Auto CMD12.
//!
//! \return true if the Auto CMD12 disable operation is successed, false others.
//
//*****************************************************************************
tBoolean
MSCAutoCMD12Disable(unsigned long ulBase)
{
    //
    // Check the arguments.
    //
    ASSERT(MSCBaseValid(ulBase));

    HWREG(ulBase + MSC_O_CMDAT) &= ~MSC_CMDAT_AUTOCMD12;
    return((HWREG(ulBase + MSC_O_CMDAT) & MSC_CMDAT_AUTOCMD12) != MSC_CMDAT_AUTOCMD12);
}

//*****************************************************************************
//
//! MSC command index set.
//!
//! \param ulBase is the base address of the MSC.
//! \param ulCommandIndex is the the command index(opcode).
//!
//! This function set command index.
//!
//! \return true if the opcode set operation is successed, false others.
//
//*****************************************************************************
tBoolean
MSCCommandIndexSet(unsigned long ulBase, unsigned long ulCommandIndex)
{
    //
    // Check the arguments.
    //
    ASSERT(MSCBaseValid(ulBase));

    HWREGB(ulBase + MSC_O_CMD) = (ulCommandIndex & MSC_CMD_CMDINDEX);
    return((HWREGB(ulBase + MSC_O_CMD) & MSC_CMD_CMDINDEX) == (ulCommandIndex & MSC_CMD_CMDINDEX));
}

//*****************************************************************************
//
//! MSC command argument set.
//!
//! \param ulBase is the base address of the MSC.
//! \param ulCommandArgument is the the command argument.
//!
//! This function set command argument.
//!
//! \return true if the command argument set operation is successed, false others.
//
//*****************************************************************************
tBoolean
MSCCommandArgumentSet(unsigned long ulBase, unsigned long ulCommandArgument)
{
    //
    // Check the arguments.
    //
    ASSERT(MSCBaseValid(ulBase));

    HWREG(ulBase + MSC_O_ARG) = (ulCommandArgument & MSC_ARG_ARG);
    return((HWREG(ulBase + MSC_O_ARG) & MSC_ARG_ARG) == (ulCommandArgument & MSC_ARG_ARG));
}

//*****************************************************************************
//
//! MSC new operation start.
//!
//! \param ulBase is the base address of the MSC.
//!
//! This function start a new operation.
//!
//! \return true if the new operation start operation is successed, false others.
//
//*****************************************************************************
tBoolean
MSCNewOperationStart(unsigned long ulBase)
{
    //
    // Check the arguments.
    //
    ASSERT(MSCBaseValid(ulBase));

    HWREG(ulBase + MSC_O_CTRL) |= MSC_CTRL_STARTOP;
    return((HWREG(ulBase + MSC_O_CTRL) & MSC_CTRL_STARTOP) == MSC_CTRL_STARTOP);
}

//*****************************************************************************
//
//! MSC end command response interrupt enable.
//!
//! \param ulBase is the base address of the MSC.
//!
//! This function enable end command response interrupt.
//!
//! \return true if the end command response interrupt enable operation is successed, false others.
//
//*****************************************************************************
tBoolean
MSCEndCommandResponseEnable(unsigned long ulBase)
{
    //
    // Check the arguments.
    //
    ASSERT(MSCBaseValid(ulBase));

    HWREG(ulBase + MSC_O_IMASK) &= ~MSC_IMASK_ENDCMDRES;
    return((HWREG(ulBase + MSC_O_IMASK) & MSC_IMASK_ENDCMDRES) != MSC_IMASK_ENDCMDRES);
}

//*****************************************************************************
//
//! MSC end command response interrupt disable.
//!
//! \param ulBase is the base address of the MSC.
//!
//! This function disable end command response interrupt.
//!
//! \return true if the end command response interrupt disable operation is successed, false others.
//
//*****************************************************************************
tBoolean
MSCEndCommandResponseDisable(unsigned long ulBase)
{
    //
    // Check the arguments.
    //
    ASSERT(MSCBaseValid(ulBase));

    HWREG(ulBase + MSC_O_IMASK) |= MSC_IMASK_ENDCMDRES;
    return((HWREG(ulBase + MSC_O_IMASK) & MSC_IMASK_ENDCMDRES) == MSC_IMASK_ENDCMDRES);
}

//*****************************************************************************
//
//! MSC end command response interrupt flag clear.
//!
//! \param ulBase is the base address of the MSC.
//!
//! This function clear end command response interrupt flag.
//!
//! \return true if the end command response interrupt flag clear operation is successed, false others.
//
//*****************************************************************************
tBoolean
MSCEndCommandResponseFlagClear(unsigned long ulBase)
{
    //
    // Check the arguments.
    //
    ASSERT(MSCBaseValid(ulBase));

    HWREG(ulBase + MSC_O_IFLG) |= MSC_IFLG_ENDCMDRES;
    return((HWREG(ulBase + MSC_O_IFLG) & MSC_IFLG_ENDCMDRES) != MSC_IFLG_ENDCMDRES);
}

//*****************************************************************************
//
//! MSC end command response interrupt flag get.
//!
//! \param ulBase is the base address of the MSC.
//!
//! This function get end command response interrupt flag's value.
//!
//! \return true if the end command response interrupt flag is set(by hardware), false others.
//
//*****************************************************************************
tBoolean
MSCEndCommandResponseFlagGet(unsigned long ulBase)
{
    //
    // Check the arguments.
    //
    ASSERT(MSCBaseValid(ulBase));

    return((HWREG(ulBase + MSC_O_IFLG) & MSC_IFLG_ENDCMDRES) == MSC_IFLG_ENDCMDRES);
}

//*****************************************************************************
//
//! MSC SDIO interrupt flag get.
//!
//! \param ulBase is the base address of the MSC.
//!
//! This function get SDIO interrupt flag's value.
//!
//! \return true if the SDIO interrupt flag is set(by hardware), false others.
//
//*****************************************************************************
tBoolean
MSCSDIOInterruptFlagGet(unsigned long ulBase)
{
    //
    // Check the arguments.
    //
    ASSERT(MSCBaseValid(ulBase));

