harviswang/linux-3.10.99/arch/mips/m200/driverlib/msc.c
    return((HWREG(ulBase + MSC_O_IFLG) & MSC_IFLG_SDIO) == MSC_IFLG_SDIO);
}

//*****************************************************************************
//
//! MSC command response get.
//!
//! \param ulBase is the base address of the MSC.
//!
//! This function get command response value.
//!
//! \return command response.
//
//*****************************************************************************
unsigned long
MSCCommandResponseGet(unsigned long ulBase)
{
    //
    // Check the arguments.
    //
    ASSERT(MSCBaseValid(ulBase));
    return(HWREGH(ulBase + MSC_O_RES) & MSC_RES_DATA);
}

//*****************************************************************************
//
//! MSC data transfer done interrupt enable.
//!
//! \param ulBase is the base address of the MSC.
//!
//! This function enable data transfer done interrupt.
//!
//! \return true if enable is successed, false others.
//
//*****************************************************************************
tBoolean
MSCDataTransferDoneEnable(unsigned long ulBase)
{
    //
    // Check the arguments.
    //
    ASSERT(MSCBaseValid(ulBase));

    HWREG(ulBase + MSC_O_IMASK) &= ~MSC_IMASK_DATATRANDONE;
    return((HWREG(ulBase + MSC_O_IMASK) & MSC_IMASK_DATATRANDONE) != MSC_IMASK_DATATRANDONE);
}

//*****************************************************************************
//
//! MSC data transfer done interrupt disable.
//!
//! \param ulBase is the base address of the MSC.
//!
//! This function disable data transfer done interrupt.
//!
//! \return true if the interrupt disable operation is successed, false others.
//
//*****************************************************************************
tBoolean
MSCDataTransferDoneDisable(unsigned long ulBase)
{
    //
    // Check the arguments.
    //
    ASSERT(MSCBaseValid(ulBase));

    HWREG(ulBase + MSC_O_IMASK) |= MSC_IMASK_DATATRANDONE;
    return((HWREG(ulBase + MSC_O_IMASK) & MSC_IMASK_DATATRANDONE) == MSC_IMASK_DATATRANDONE);
}

//*****************************************************************************
//
//! MSC data transfer done flag get.
//!
//! \param ulBase is the base address of the MSC.
//!
//! This function get data transfer done flag.
//!
//! \return the value of data transfer done flag.
//
//*****************************************************************************
tBoolean
MSCDataTransferDoneFlagClear(unsigned long ulBase)
{
    //
    // Check the arguments.
    //
    ASSERT(MSCBaseValid(ulBase));

    HWREG(ulBase + MSC_O_IFLG) |= MSC_IFLG_DATATRANDONE;
    return((HWREG(ulBase + MSC_O_IFLG) & MSC_IFLG_DATATRANDONE) != MSC_IFLG_DATATRANDONE);
}

//*****************************************************************************
//
//! MSC data transfer done flag get.
//!
//! \param ulBase is the base address of the MSC.
//!
//! This function get data transfer done flag.
//!
//! \return the value of data transfer done flag.
//
//*****************************************************************************
tBoolean
MSCDataTransferDoneFlagGet(unsigned long ulBase)
{
    //
    // Check the arguments.
    //
    ASSERT(MSCBaseValid(ulBase));

    return((HWREG(ulBase + MSC_O_IFLG) & MSC_IFLG_DATATRANDONE) == MSC_IFLG_DATATRANDONE);
}

//*****************************************************************************
//
//! MSC DMA Descriptor Address set.
//!
//! \param ulBase is the base address of the MSC.
//! \param ulDMADescriptorAddress is the DMA descriptor address.
//!
//! This function set DMA descriptor address.
//!
//! \return true if set DMA descriptor address operation successful, false others.
//
//*****************************************************************************
tBoolean
MSCDMADescriptorAddressSet(unsigned long ulBase, unsigned long ulDMADescriptorAddress)
{
    //
    // Check the arguments.
    //
    ASSERT(MSCBaseValid(ulBase));

    HWREG(ulBase + MSC_O_DMANDA) = ulDMADescriptorAddress & MSC_DMANDA_NDA;
    return((HWREG(ulBase + MSC_O_DMANDA) & MSC_DMANDA_NDA) == (ulDMADescriptorAddress & MSC_DMANDA_NDA));
}

//*****************************************************************************
//
//! MSC DMA Descriptor Address Get.
//!
//! \param ulBase is the base address of the MSC.
//!
//! This function get last DMA descriptor address.
//!
//! \return DMA descriptor address set before.
//
//*****************************************************************************
unsigned long
MSCDMADescriptorAddressGet(unsigned long ulBase)
{
    //
    // Check the arguments.
    //
    ASSERT(MSCBaseValid(ulBase));

    return(HWREG(ulBase + MSC_O_DMANDA) & MSC_DMANDA_NDA);
}

//*****************************************************************************
//
//! MSC DMA Data Done Enable.
//!
//! \param ulBase is the base address of the MSC.
//!
//! This function enable MSC DMA Data Done interrupt.
//!
//! \return true if the DMA data done enable opreation is success, others false.
//
//*****************************************************************************
tBoolean
MSCDMADataDoneEnable(unsigned long ulBase)
{
    //
    // Check the arguments.
    //
    ASSERT(MSCBaseValid(ulBase));

    HWREG(ulBase + MSC_O_IMASK) &= ~MSC_IMASK_DMADATADONE;
    return((HWREG(ulBase + MSC_O_IMASK) & MSC_IMASK_DMADATADONE) != MSC_IMASK_DMADATADONE);
}

//*****************************************************************************
//
//! MSC DMA Data Done Disable.
//!
//! \param ulBase is the base address of the MSC.
//!
//! This function disable MSC DMA Data Done interrupt.
//!
//! \return true if the DMA data done disable opreation is success, others false.
//
//*****************************************************************************
tBoolean
MSCDMADataDoneDisable(unsigned long ulBase)
{
    //
    // Check the arguments.
    //
    ASSERT(MSCBaseValid(ulBase));

    HWREG(ulBase + MSC_O_IMASK) |= MSC_IMASK_DMADATADONE;
    return((HWREG(ulBase + MSC_O_IMASK) & MSC_IMASK_DMADATADONE) == MSC_IMASK_DMADATADONE);
}

//*****************************************************************************
//
//! MSC DMA Data Done flag get.
//!
//! \param ulBase is the base address of the MSC.
//!
//! This function get the value of MSC DMA Data Done flag.
//!
//! \return the value of MSC DMA Data Done flag.
//
//*****************************************************************************
tBoolean
MSCDMADataDoneFlagGet(unsigned long ulBase)
{
    //
    // Check the arguments.
    //
    ASSERT(MSCBaseValid(ulBase));

    return((HWREG(ulBase + MSC_O_IFLG) & MSC_IFLG_DMADATADONE) == MSC_IFLG_DMADATADONE);
}

//*****************************************************************************
//
//! MSC DMA enable(start).
//!
//! \param ulBase is the base address of the MSC.
//!
//! This function start DMA operation.
//!
//! \return true if DMA enable operation successed, false others.
//
//*****************************************************************************
tBoolean
MSCDMAEnable(unsigned long ulBase)
{
    //
    // Check the arguments.
    //
    ASSERT(MSCBaseValid(ulBase));

    HWREG(ulBase + MSC_O_DMAC) |= MSC_DMAC_DMAEN;
    return((HWREG(ulBase + MSC_O_DMAC) & MSC_DMAC_DMAEN) == MSC_DMAC_DMAEN);
}

//*****************************************************************************
//
//! MSC DMA disable(stop).
//!
//! \param ulBase is the base address of the MSC.
//!
//! This function stop DMA operation.
//!
//! \return true if DMA disable operation successed, false others.
//
//*****************************************************************************
tBoolean
MSCDMADisable(unsigned long ulBase)
{
    //
    // Check the arguments.
    //
    ASSERT(MSCBaseValid(ulBase));

    HWREG(ulBase + MSC_O_DMAC) &= ~MSC_DMAC_DMAEN;
    return((HWREG(ulBase + MSC_O_DMAC) & MSC_DMAC_DMAEN) != MSC_DMAC_DMAEN);
}

//*****************************************************************************
//
//! MSC data enable.
//!
//! \param ulBase is the base address of the MSC.
//!
//! This function enable current command transfer data.
//!
//! \return true if data enable operation success, false others.
//
//*****************************************************************************
tBoolean
MSCDataEnable(unsigned long ulBase)
{
    //
    // Check the arguments.
    //
    ASSERT(MSCBaseValid(ulBase));

    HWREG(ulBase + MSC_O_CMDAT) |= MSC_CMDAT_DATALEN;
    return((HWREG(ulBase + MSC_O_CMDAT) & MSC_CMDAT_DATALEN) == MSC_CMDAT_DATALEN);
}

//*****************************************************************************
//
//! MSC data disable.
//!
//! \param ulBase is the base address of the MSC.
//!
//! This function disable current command transfer data.
//!
//! \return true if data disable operation success, false others.
//
//*****************************************************************************
tBoolean
MSCDataDisable(unsigned long ulBase)
{
    //
    // Check the arguments.
    //
    ASSERT(MSCBaseValid(ulBase));

    HWREG(ulBase + MSC_O_CMDAT) &= ~MSC_CMDAT_DATALEN;
    return((HWREG(ulBase + MSC_O_CMDAT) & MSC_CMDAT_DATALEN) != MSC_CMDAT_DATALEN);
}
